# ScheduleSheetInstance Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ScheduleSheetInstance Class
Members See Also
---
An element that represents a particular placement of a schedule on a sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class ScheduleSheetInstance : Element
```

Visual Basic
---
```text
Public Class ScheduleSheetInstance _
	Inherits Element
```

Visual C++
---
```text
public ref class ScheduleSheetInstance : public Element
```

# Remarks
Use ScheduleSheetInstance.OwnerViewId to find the sheet on which a schedule is placed.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ScheduleSheetInstance
# See Also
ScheduleSheetInstance Members
Autodesk.Revit.DB Namespace